app/controllers/images_controller.rb

SELECT * FROM "images"
---
  def index
    @images = Image.all

SELECT * FROM "images" WHERE ("images"."id" = 1)
---
  def show
    @image = Image.find(params[:id])

INSERT INTO "images" ("name", "image_file_size", "updated_at", "image_content_type", "created_at", "image_file_name") VALUES(NULL, 77700, '2009-09-12 14:57:16', 'image/jpeg', '2009-09-12 14:57:16', 'Photo 1.jpg')
---
  def create
    @image = Image.new(params[:image])
    @image.image = params[:Filedata]
    @image.image_content_type = 'image/jpeg'
    @return = {}
    respond_to do |format|
      if @image.save

SELECT * FROM "images" WHERE ("images"."id" = 11)
DELETE FROM "images" WHERE "id" = 11
---
  def destroy
    @image = Image.find(params[:id])
    @image.destroy